app/controllers/companies/sessions_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."user_name" = ?  ORDER BY "companies"."id" ASC LIMIT 1  [["user_name", "Tokyo"]]
---
  def find_resource
    @resource = Company.find_by_user_name sign_in_params[:user_name] if sign_in_params[:user_name].present?